==================
an empty section
==================

{% section name %}
{% endsection %}

---

(fragment
  (tpl_section
    (tpl_start_tag
      (tpl_tag_name)
      (tpl_tag_attributes))
    (tpl_end_tag
      (tpl_tag_name))))


==================
a section with nested text
==================

{% section name %}
  Hello
{% endsection %}

---

(fragment
  (tpl_section
    (tpl_start_tag
      (tpl_tag_name)
      (tpl_tag_attributes))
    (text)
    (tpl_end_tag
      (tpl_tag_name))))


==================
a section with nested elements
==================

{% section name %}
  <div>Hello</div>
{% endsection %}

---

(fragment
  (tpl_section
    (tpl_start_tag
      (tpl_tag_name)
      (tpl_tag_attributes))
    (element
      (start_tag
        (tag_name))
      (text)
      (end_tag
        (tag_name)))
    (tpl_end_tag
      (tpl_tag_name))))


==================
a section inside the element's attribute aria
==================

<html {% section html_attrs %}lang="en"{% endsection %}></html>

---

(fragment
  (element
    (start_tag
      (tag_name)
      (tpl_section
        (tpl_start_tag
          (tpl_tag_name)
          (tpl_tag_attributes))
        (attribute
          (attribute_name)
          (quoted_attribute_value
            (attribute_value
              (value_fragment))))
        (tpl_end_tag
          (tpl_tag_name))))
    (end_tag
      (tag_name))))

==================
a section inside an attribute value wrapped in double quotes
==================

<html class="{% section body_class %}foo'{% endsection %}"></html>

---

(fragment
  (element
    (start_tag
      (tag_name)
      (attribute
        (attribute_name)
        (quoted_attribute_value
          (attribute_value
            (tpl_section
              (tpl_start_tag
                (tpl_tag_name)
                (tpl_tag_attributes))
              (value_fragment)
              (tpl_end_tag
                (tpl_tag_name)))))))
    (end_tag
      (tag_name))))

==================
a section inside an attribute value wrapped in single quotes
==================

<html class='{% section body_class %}foo"{% endsection %}'></html>

---

(fragment
  (element
    (start_tag
      (tag_name)
      (attribute
        (attribute_name)
        (quoted_attribute_value
          (attribute_value
            (tpl_section
              (tpl_start_tag
                (tpl_tag_name)
                (tpl_tag_attributes))
              (value_fragment)
              (tpl_end_tag
                (tpl_tag_name)))))))
    (end_tag
      (tag_name))))
